[
    {
        "id": "debuter-programmation",
        "title": "Comment débuter la programmation en 2025 ?",
        "date": "2025-01-15",
        "summary": "Guide complet pour les débutants : langages à choisir, ressources gratuites et pièges à éviter.",
        "content": "<h2>Pourquoi apprendre à coder ?</h2><p>La programmation est devenue une compétence essentielle dans le monde numérique d'aujourd'hui. Que ce soit pour automatiser des tâches, créer des sites web ou analyser des données, savoir coder ouvre de nombreuses portes.</p><h2>Par quel langage commencer ?</h2><p>Pour les débutants, je recommande souvent <strong>Python</strong> pour sa syntaxe simple et lisible, ou <strong>JavaScript</strong> si vous êtes intéressé par le développement web.</p><h2>Ressources recommandées</h2><ul><li>FreeCodeCamp</li><li>OpenClassrooms</li><li>Documentation officielle (MDN, Python Docs)</li></ul>",
        "tags": [
            "Développement",
            "Conseils"
        ],
        "link": "#"
    },
    {
        "id": "ia-web-dev",
        "title": "L'impact de l'IA sur le développement Web",
        "date": "2025-02-28",
        "summary": "Analyse de l'évolution du métier de développeur avec l'arrivée d'outils comme ChatGPT et Copilot.",
        "content": "<h2>Une révolution en marche</h2><p>L'intelligence artificielle transforme radicalement la façon dont nous écrivons du code. Des outils comme GitHub Copilot agissent comme des binômes virtuels, suggérant des lignes de code entières.</p><h2>L'IA va-t-elle remplacer les développeurs ?</h2><p>Non, mais elle va changer leur rôle. Le développeur passera moins de temps sur la syntaxe et plus sur l'architecture, la résolution de problèmes complexes et la vérification du code généré.</p>",
        "tags": [
            "IA",
            "Tech"
        ],
        "link": "#"
    },
    {
        "id": "setup-productif",
        "title": "Mon setup pour être productif",
        "date": "2025-01-10",
        "summary": "Présentation de mes outils : VS Code, extensions indispensables et configuration matérielle.",
        "content": "<h2>Mon environnement de développement</h2><p>J'utilise principalement <strong>Visual Studio Code</strong> avec le thème Dracula. C'est un éditeur léger mais extrêmement puissant grâce à son écosystème d'extensions.</p><h2>Extensions indispensables</h2><ul><li>Prettier pour le formatage</li><li>ESLint pour la qualité du code</li><li>GitLens pour la gestion de version</li></ul><h2>Matériel</h2><p>Je travaille sur une machine Linux optimisée pour le développement, avec un double écran pour garder la documentation à portée de vue.</p>",
        "tags": [
            "Setup",
            "Productivité"
        ],
        "link": "#"
    }
]